InformationRegisters/НастройкиУдаленияРезультатовЗаданийСервисовOneScriptАИТП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>НастройкиУдаленияРезультатовЗаданийСервисовOneScriptАИТП</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПериодУдаления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоПопыток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИнтервалМеждуПопытками</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сервис</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СервисыOneScriptАИТП</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/РезультатыВыполненияДействияАИТП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Enum>
		<Properties>
			<Name>РезультатыВыполненияДействияАИТП</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Положительный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отрицательный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ошибка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ДальнейшиеДействияАИТП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Enum>
		<Properties>
			<Name>ДальнейшиеДействияАИТП</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Продолжить</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Повторить</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершить</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменить</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/ОбработатьОшибкуУдаленияРезультатовЗаданийСервисаOneScriptАИТП/Ext/Module.bsl
///////////////////////////////////////////////////////////////////////////////////
//
// Обработчики действий бизнес-процесса ОбработатьОшибкуУдаленияРезультатовЗаданийСервисаOneScriptАИТП
//
//////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

// Обработчик действия УдалитьРезультатыЗаданийСервисаOneScript
//
// Параметры:
//  ТочкаМаршрута  - БизнесПроцессы.УдалитьРезультатыЗаданийСервисаOneScriptАИТП.ТочкиМаршрута.УдалитьРезультатыЗаданийСервисаOneScript - точка маршрута действия
//  Задача  - ЗадачаСсылка.ЗадачаАИТП - Ссылка на выполняемую задачу
//  ПараметрыВыполнения  - Соответствие - параметры выполнения
//
Процедура УдалитьРезультатыЗаданийСервисаOneScript(ТочкаМаршрута, Задача, ПараметрыВыполнения) Экспорт
	// Вставить содержимое обработчика.
	БизнесПроцесс = Задача.БизнесПроцесс;
	
	МенеджерЗаписи = РегистрыСведений.НастройкиУдаленияРезультатовЗаданийСервисовOneScriptАИТП.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Сервис = БизнесПроцесс.Сервис;
	МенеджерЗаписи.Прочитать();
		
	//OneScriptАИТП.УдалитьРезультатыВыполненияЗаданийСозданныхДоПериода(МенеджерЗаписи.ПериодУдаления, БизнесПроцесс.Сервис);
	
	Параметры = Новый Массив;
	Параметры.Добавить(МенеджерЗаписи.ПериодУдаления);
	Результат = OneScriptАИТП.ВыполнитьМетод("ITPA.УдалитьРезультатыВыполненияЗаданийСозданныхДоПериода",Параметры , Ложь,, БизнесПроцесс.Сервис);
	
	Если Результат["БылиОшибки"] = Истина Тогда
		Задача.Результат = Перечисления.РезультатыВыполненияДействияАИТП.Отрицательный;
		Задача.ОписаниеРезультата = Результат["ОписаниеОшибки"];	
	Иначе
		Задача.Результат = Перечисления.РезультатыВыполненияДействияАИТП.Положительный;
	КонецЕсли;
	
	Задача.ДальнейшиеДействия = Перечисления.ДальнейшиеДействияАИТП.Продолжить;
	Задача.Записать();
	
КонецПроцедуры

#КонецОбласти
